> As discussed elsewhere, I think you'll need to add `Computed: true` to the new argument as a default value of the current AWS Region is assigned. This can be verified via a now failing test of the `aws_vpc` data source:
> 
> ```
> === CONT  TestAccEC2VPCDataSource_ipv6Associated
>     vpc_data_source_test.go:92: Step 1/1 error: After applying this test step, the plan was not empty.
>         stdout:
>         
>         
>         Terraform used the selected providers to generate the following execution
>         plan. Resource actions are indicated with the following symbols:
>           ~ update in-place
>          <= read (data resources)
>         
>         Terraform will perform the following actions:
>         
>           # data.aws_vpc.by_id will be read during apply
>           # (config refers to values not yet known)
>          <= data "aws_vpc" "by_id"  {
>               ~ arn                     = "arn:aws:ec2:us-west-2:123456789012:vpc/vpc-03c7db19424697981" -> (known after apply)
>               ~ cidr_block              = "10.93.0.0/16" -> (known after apply)
>               ~ cidr_block_associations = [
>                   - {
>                       - association_id = "vpc-cidr-assoc-0fae851f23aefcf2c"
>                       - cidr_block     = "10.93.0.0/16"
>                       - state          = "associated"
>                     },
>                 ] -> (known after apply)
>               ~ default                 = false -> (known after apply)
>               ~ dhcp_options_id         = "dopt-11ac7e74" -> (known after apply)
>               ~ enable_dns_hostnames    = false -> (known after apply)
>               ~ enable_dns_support      = true -> (known after apply)
>                 id                      = "vpc-03c7db19424697981"
>               ~ instance_tenancy        = "default" -> (known after apply)
>               ~ ipv6_association_id     = "vpc-cidr-assoc-00359e176d59ccdbd" -> (known after apply)
>               ~ ipv6_cidr_block         = "2600:1f13:cf0:3b00::/56" -> (known after apply)
>               ~ main_route_table_id     = "rtb-00ac9a89b69467bdf" -> (known after apply)
>               ~ owner_id                = "123456789012" -> (known after apply)
>               ~ state                   = "available" -> (known after apply)
>               ~ tags                    = {
>                   - "Name" = "terraform-testacc-vpc-data-source-ipv6-associated-93"
>                 } -> (known after apply)
>             }
>         
>           # aws_vpc.test will be updated in-place
>           ~ resource "aws_vpc" "test" {
>                 id                                   = "vpc-03c7db19424697981"
>               - ipv6_cidr_block_network_border_group = "us-west-2" -> null
>                 tags                                 = {
>                     "Name" = "terraform-testacc-vpc-data-source-ipv6-associated-93"
>                 }
>                 # (17 unchanged attributes hidden)
>             }
>         
>         Plan: 0 to add, 1 to change, 0 to destroy.
> ```

Kit - fully agree, I got your comments through another mechanism and understand why. I've updated locally and running the tests to make sure they all pass. Assuming they do, I'll update the code.